Revit 2026 API

# InitialFluxIntensity Properties

---

The InitialFluxIntensity type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Flux | The flux intensity value. |
|  | InitialIntensityValue | The calculated initial intensity value. (Inherited from InitialIntensity) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from InitialIntensity) |

#### Reference

InitialFluxIntensity Class

Autodesk.Revit.DB.Lighting Namespace